tutorials/DLpimpleFoam_delta_delta_shift/system/extrudeMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}

constructFrom mesh;
sourceCase ".";
sourcePatches    (outlet);            // Name of the patch to extrude from
extrudeType      patchNormal;
exposedPatchName outlet;
direction (1 0 0);

flipNormals false;

extrudeModel linearDirection;

expansionRatio 1.035;
firstLayerThickness 0.01;
nLayers 60;


linearDirectionCoeffs
{
    direction (1 0 0);
    thickness 2.2;
}

mergeFaces false;
mergeTol 0;
