tutorials/DLpimpleFoam_delta_delta_shift/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/.";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.015;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            kqRWallFunction;
        value           uniform 0.015;
    }
    back
    {
        type            kqRWallFunction;
        value           uniform 0.015;
    }
    top
    {
        type            kqRWallFunction;
        value           uniform 0.015;
    }
    bot
    {
        type            kqRWallFunction;
        value           uniform 0.015;
    }
    obstacle
    {
        type            kqRWallFunction;
        value           uniform 0.015;
    }
}


// ************************************************************************* //
